Revit 2024 API
ParameterTypeId.RebarSystemHookTypeFrontDirn2 Property
 "Exterior Minor Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarSystemHookTypeFrontDirn2 { get; }
Visual Basic
Public Shared ReadOnly Property RebarSystemHookTypeFrontDirn2 As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarSystemHookTypeFrontDirn2 {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace